In [63]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

### Q1. Create a Pandas Series using a list of 5 fruits. Print the 3rd fruit using index

In [64]:
fruits=['apple','banana','cherry','orange','watermelon']
series=pd.Series(fruits)
series.iloc[2]

'cherry'

### Q2. You are given a list of student names and their scores. Convert it into a Series and display the score of the student named "Anu".

In [65]:
dist={
    'aditya': 94,
    'Anu':98,
    'Shree':100
}
series=pd.Series(dist)
print(series.loc['Anu'])

98

### Q3. Create a DataFrame with columns Name, Age, Marks. Display only the Marks column.

In [66]:
dist={
    'Name':['Aditya','Anu','Shree'],
    'Age':[21,87,21],
    'Marks':[94,98,100]
}
df=pd.DataFrame(dist)
df['Marks']

0     94
1     98
2    100
Name: Marks, dtype: int64

### Q4. From a DataFrame of employees with columns Name, Salary, and Department, use .loc to display the salary of the employee named "Raj".

In [67]:
dist={
    'Name':['Aditya','Raj','Shree'],
    'salary':[21,87,21],
    'dept':[94,98,100]
}
df=pd.DataFrame(dist, index=['Aditya','Raj','Shree'])
print(df.loc['Raj','salary'])

87

### Q5. Use .iloc to print the first 3 rows from a DataFrame containing student information

In [68]:
dist={
    'Name':['Aditya','Anu','Shree','Aditya','Anu','Shree'],
    'Age':[21,87,21,21,87,21],
    'Marks':[94,98,100,94,98,100]
}
df=pd.DataFrame(dist)
df.iloc[:3]

     Name  Age  Marks
0  Aditya   21     94
1     Anu   87     98
2   Shree   21    100

### Q6. Given a DataFrame of customer records, use .at to update the value of a specific cell at row index 2 and column Name.

In [69]:
dist={
    'Name':['Aditya','Raj','Shree'],
    'salary':[21,87,21],
    'dept':[94,98,100]
}
df=pd.DataFrame(dist)
df.at[2,'Name']='shree'
df

     Name  salary  dept
0  Aditya      21    94
1     Raj      87    98
2   shree      21   100

### Q7. Create a DataFrame with some NaN values in the Marks column. Replace all NaN values with the average (mean) of the Marks column

In [70]:
dist={
    'Name':['Aditya','Anu','Shree','Aditya','Anu','Shree'],
    'Age':[21,87,21,21,87,21],
    'Marks':[94,98,None,94,None,100]
}
df=pd.DataFrame(dist)
df.fillna(np.mean(df['Marks']))

     Name  Age  Marks
0  Aditya   21   94.0
1     Anu   87   98.0
2   Shree   21   96.5
3  Aditya   21   94.0
4     Anu   87   96.5
5   Shree   21  100.0

### Q8. Load an Excel file named students.xlsx containing student data. Print the first 5 rows of the file.

In [71]:
df=pd.read_excel('students.xlsx')
df.head(5)

   Rollno Name  Dept  Marks  Age
0       1    A    IT  100.0    9
1       2    B    IT   86.0   10
2       3    C    IT    NaN   11
3       4    D  COMP   95.0   12
4       5    E  COMP   96.0   13

### Q9. After loading the Excel file, check and display the rows where the Age column is null using .loc.

In [72]:
df.loc[df['Marks'].isnull()]

    Rollno Name   Dept  Marks  Age
2        3    C     IT    NaN   11
7        8    H  AI&DS    NaN   16
12      13    M   COMP    NaN   21
20      21    U     IT    NaN   29
25      26    Z     IT    NaN   12
28      29   CC     IT    NaN   14

### Q10. Calculate the mean of the Salary column from a DataFrame of employee details.

In [73]:
df=pd.read_excel('employees.xlsx')
print('mean salary',np.mean(df['salary']))

mean salary 10464.5

### Q11. You are given a DataFrame df with missing values in the Score column. Use .loc to fill only those missing values with 75.

In [74]:
df=pd.read_excel('students.xlsx')
df['Marks'].fillna(75)

0     100.0
1      86.0
2      75.0
3      95.0
4      96.0
5      97.0
6      98.0
7      75.0
8     100.0
9      87.0
10     88.0
11     89.0
12     75.0
13     91.0
14     92.0
15     93.0
16     94.0
17     95.0
18     96.0
19     97.0
20     75.0
21     99.0
22     78.0
23     79.0
24     80.0
25     75.0
26     82.0
27     83.0
28     75.0
29     85.0
Name: Marks, dtype: float64

### Q12. Given a DataFrame df with student grades, use .iloc to print rows 2 to 5 and columns 1 to 3.

In [75]:
df=pd.read_excel('students.xlsx')
print(df.iloc[2:6,1:4])

  Name  Dept  Marks
2    C    IT    NaN
3    D  COMP   95.0
4    E  COMP   96.0
5    F  COMP   97.0

### Q13. Use .loc to filter and print all rows where the Age is greater than 20 from a DataFrame.

In [76]:
df=pd.read_excel('students.xlsx')
print(df.loc[df['Age']>20])

    Rollno Name  Dept  Marks  Age
12      13    M  COMP    NaN   21
13      14    N  COMP   91.0   22
14      15    O  COMP   92.0   23
15      16    P  COMP   93.0   24
16      17    Q  COMP   94.0   25
17      18    R  COMP   95.0   26
18      19    S  COMP   96.0   27
19      20    T    IT   97.0   28
20      21    U    IT    NaN   29
21      22    V    IT   99.0   30
22      23    W    IT   78.0   43
24      25    Y    IT   80.0   24
26      27   AA    IT   82.0   24
27      28   BB    IT   83.0   35
29      30   DD    IT   85.0   35

### Q14. Create a DataFrame from a dictionary of items (Item, Quantity, Price) and calculate the total price for each row using a new column Total = Quantity * Price.

In [77]:
dict1={
    'item':['item1','item2','item3','item4','item5','item6'],
    'quantity':[5,47,2,9,1,43],
    'Price':[432,765,35,123,900,540]
}
df=pd.DataFrame(dict1)
df['Total']=(df['quantity']*df['Price'])
df

    item  quantity  Price  Total
0  item1         5    432   2160
1  item2        47    765  35955
2  item3         2     35     70
3  item4         9    123   1107
4  item5         1    900    900
5  item6        43    540  23220

### Q15. You have a DataFrame of city temperatures. Some values in the Temperature column are missing. Fill them using the average temperature calculated using mean().

In [79]:
dict1={
    'city':['city1','city2','city3','city4','city5','city6','city7','city8','city9','city10'],
    'temperature':[5,47,None,9,None,43,53,32,None,14],
}
df=pd.DataFrame(dict1)
df.fillna(np.mean(df['temperature']))

     city  temperature
0   city1          5.0
1   city2         47.0
2   city3         29.0
3   city4          9.0
4   city5         29.0
5   city6         43.0
6   city7         53.0
7   city8         32.0
8   city9         29.0
9  city10         14.0